#### Time Count

In [178]:
from time import time
t_start = time()
print('done in %0.3f minutes.' % ((time() - t_start) / 60))

done in 0.000 minutes.

#### Time Related

In [8]:
date_format = "%Y-%m-%d"
from datetime import datetime
from datetime import timedelta
from datetime import date

now = date.today() #datetime.now()
yesterday = now + timedelta(days=-2)
print(now, yesterday.strftime(date_format))

print(now, yesterday)

2019-01-08 2019-01-06
2019-01-08 2019-01-06

In [14]:
# Calculate Difference (Method 1)
# Calculate duration between features
print(df['Left'] - df['Arrived'])

# Calculate Difference (Method 2)
# Calculate duration between features
pd.Series(delta.days for delta in (df['Left'] - df['Arrived']))

0   0 days
1   2 days
dtype: timedelta64[ns]

0    0
1    2
dtype: int64

In [19]:
# Create data frame
import pandas as pd
df = pd.DataFrame()

# Create two datetime features
df['Arrived'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-04-2017')]
df['Left'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-06-2017')]

df

     Arrived       Left
0 2017-01-01 2017-01-01
1 2017-01-04 2017-01-06

In [8]:
# Select Time Range (Method 1)
df[df['Arrived']>'2017-01-03']


# Select Time Range (Method 2)
df = df.set_index(df['Left'])
df.loc['2017-01-01':'2017-01-04']

     Arrived       Left
1 2017-01-04 2017-01-06

#### Time Loop

In [17]:
from datetime import date
from dateutil.rrule import rrule, DAILY
a = date(2018, 8, 25)
b = date(2018, 8, 29)
for dt in rrule(DAILY, dtstart=a, until=b):
    datelist = dt.strftime('%Y-%m-%d').split('-')
    print(dt, datelist)

2018-08-25 00:00:00 ['2018', '08', '25']
2018-08-26 00:00:00 ['2018', '08', '26']
2018-08-27 00:00:00 ['2018', '08', '27']
2018-08-28 00:00:00 ['2018', '08', '28']
2018-08-29 00:00:00 ['2018', '08', '29']

#### List

In [149]:
# append
stack = ['a','b']
stack.append(['e','f'])
# extend
stack.extend(['e','f'])

In [374]:
# sort
cars = ['Ford', 'BMW', 'Volvo']
cars.sort(reverse=True)

In [375]:
cars

['Volvo', 'Ford', 'BMW']

In [377]:
sorted(cars,reverse=False)

['BMW', 'Ford', 'Volvo']

In [11]:
a = [1,2,3,4,5]
b = [2,3,4,5,6]
#concat two list
print(a+b)
#values added
print([x+y for x, y in zip(a,b)])

[1, 2, 3, 4, 5, 2, 3, 4, 5, 6]
[3, 5, 7, 9, 11]

In [15]:
# Create Counts Of Items
from collections import Counter
# Create a counter of the fruits eaten today
fruit_eaten = Counter(['Apple', 'Apple', 'Apple', 'Banana', 'Pear', 'Pineapple'])
# View counter
print(dict(fruit_eaten))
# Update the count for 'Pineapple' (because you just ate an pineapple)
fruit_eaten.update(['Pineapple'])
# View the counter
print(dict(fruit_eaten))
# View the items with the top 3 counts
print(fruit_eaten.most_common(3))

{'Apple': 3, 'Banana': 1, 'Pear': 1, 'Pineapple': 1}
{'Apple': 3, 'Banana': 1, 'Pear': 1, 'Pineapple': 2}
[('Apple', 3), ('Pineapple', 2), ('Banana', 1)]

#### Set

In [142]:
# sort: there is no .sort() function for set, because set is a randomized order list essentiallyy
cars = set(cars)
sorted(cars)

['BMW', 'Ford', 'Volvo']

# DataFrame 
-  structure: https://chrisalbon.com/python/data_wrangling/pandas_data_structures/
-  drop: https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/

### Create DataFrame

In [91]:
# create df, insert data from a lit
import pandas as pd
columns = ['name','year','reports']
values_by_columns = [['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],[2012, 2012, 2013, 2014, 2014], [4, 24, 31, 2, 3]]
values_by_rows = list(zip(*values_by_columns))
index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma']
df = pd.DataFrame(columns = columns)


for value in values_by_rows:
    df.loc[len(df)] = value

df.index = index

In [92]:
df

             name  year reports
Cochice     Jason  2012       4
Pima        Molly  2012      24
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3

### Indexing, iteration

#### Access a single value

In [93]:
# get value in pd
df.at['Pima', 'year']
df.iat[1, 2]
# get value within a Series
df.loc['Pima'].at['year']
df.loc['Pima'].iat[1]

2012

#### Access a group of rows and columns

In [94]:
# filter multiple rows and columns by index
df.iloc[0:2,[1,2]]
# filter multiple rows and columns by name 
df.loc[['Pima','Yuma'],['name','year']] 


# .ix[] is used to index a dataframe by both name and position
df.ix[0:2,['name','year']] 
# view a value - View the value based on row and column
df.ix[3,'name']
df.name.ix[3] #You can also select the column first with dot notation, then the row index, which looks a little cleaner.

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:8: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:11: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  # This is added back by InteractiveShellApp.init_path()

'Jake'

####  Insert rows

In [95]:
# insert a row by index
df.loc['April'] = ['Wang',2013,5]

# insert a row by append function
row = pd.Series({'year':2013,'name':'Zhu','reports':30},name='Maggie')
df = df.append(row)

#### Add new columns

In [96]:
# add new column (list)
df['age'] = [20,31,40,31,25,11,6]

# add a new column by insert function
df.insert(0, 'dept', 'Data Analytics')

In [ ]:
# Row Bind
pd.concat([df1,df2])
df1.append(df2) # make sure the structure and column names are same

# Column Bind
pd.concat([df1, df2], axis=1, ignore_index=True)

#### Iterate DF

In [98]:
df

                      dept   name  year reports  age
Cochice     Data Analytics  Jason  2012       4   20
Pima        Data Analytics  Molly  2012      24   31
Santa Cruz  Data Analytics   Tina  2013      31   40
Maricopa    Data Analytics   Jake  2014       2   31
Yuma        Data Analytics    Amy  2014       3   25
April       Data Analytics   Wang  2013       5   11
Maggie      Data Analytics    Zhu  2013      30    6

In [ ]:
for row in df.items(): # ??
    print(row,'\n')
print('\n\n')
for key in df.keys(): # columns
    print(key)

In [ ]:
# 1. iterate over DataFrame rows as namedtuples, with index value as first element of the tuple.
for row in df.itertuples(): 
    print(row)
print('\n')

# 2. iterate over DataFrame rows as (index, Series) pairs.
for index, row in df.iterrows():
    print(index)
    print(row)
    #print(index, row.A, row.B)
print('\n')

# 3. iterator over (column name, Series) pairs.
for index, column in df.iteritems():
    print(index)
    print(column)

In [ ]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': ['a', 'b', 'f']})
df[df.isin([1, 3, 12, 'a'])]

In [ ]:
# where
df_where = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])
m = df_where % 3 == 0

df_where.where(m, -df_where)

In [ ]:
# query: query the columns of a frame with a boolean expression.
from numpy.random import randn
from pandas import DataFrame
df = DataFrame(randn(10, 2), columns=list('ab'))
df.query('a > b') # equal to df[df.a > df.b]

In [32]:
# find duplicate - not good ... only the second one will be selected as duplicates
duplicates = df.duplicated(subset=['age'])


# drop duplicate rows
df.drop_duplicates()
# drop duplicaate and keep last one
df.drop_duplicates(keep='last')
# drop duplicate by a column name
df.drop_duplicates(['name'], keep='last')

                      dept   name  year reports  age
Cochice     Data Analytics  Jason  2012       4   20
Pima        Data Analytics  Molly  2012      24   31
Santa Cruz  Data Analytics   Tina  2013      31   40
Maricopa    Data Analytics   Jake  2014       2   31
Yuma        Data Analytics    Amy  2014       3   25
April       Data Analytics   Wang  2013       5   11
Maggie      Data Analytics    Zhu  2013      30    6

In [ ]:
# Find Nans in pd
# List the NaN count for each column:
df.isnull().sum()
# Count the total number of NaNs present
df.isnull().sum().sum()

In [34]:
# set value base conditions
import numpy as np
df['performance'] = 'Not Bad'
df.loc[df['reports'] >= 30, 'performance'] = 'Awesome!'

# second method
df['performance'] = np.where(df['reports']>=30, 'Awesome!', 'Not Bad')

In [36]:
# iterate rows and get valeus of a,b column
for index, row in df.iterrows():
    print("index: %s | name: %s | year: %s" %(index, row['name'],row['year']))

index: Cochice | name: Jason | year: 2012
index: Pima | name: Molly | year: 2012
index: Santa Cruz | name: Tina | year: 2013
index: Maricopa | name: Jake | year: 2014
index: Yuma | name: Amy | year: 2014
index: April | name: Wang | year: 2013
index: Maggie | name: Zhu | year: 2013

In [37]:
# group 
df_agg = df.groupby(['year'])['name'].count() # pd series 
df_agg_df = df.groupby(['year'])['name'].count().reset_index() # data frame

In [12]:
df

                      dept   name  year reports  age
Cochice     Data Analytics  Jason  2012       4   20
Pima        Data Analytics  Molly  2012      24   31
Santa Cruz  Data Analytics   Tina  2013      31   40
Maricopa    Data Analytics   Jake  2014       2   31
Yuma        Data Analytics    Amy  2014       3   25
April       Data Analytics   Wang  2013       5   11
Maggie      Data Analytics    Zhu  2013      30    6

In [173]:
# get column names
# 1. use .columns.values
print(list(df.columns.values))
# 2. list df directly
print(list(df))

['name', 'year', 'reports', 'age', 'performance']
['name', 'year', 'reports', 'age', 'performance']

In [176]:
# rank 
df['reports_ranked']=df['reports'].rank(ascending=1,method='dense')

In [95]:
# group + sort + top n = the most reports in each year, like in year 2012, Molly has the most report: 24
df_agg = df.groupby(['year','name'])['reports'].sum().reset_index()
df_agg_sort = df_agg.sort_values(['year','reports'],ascending=[True,False])
df_agg_sort.groupby('year').head(1)

   year   name  reports
1  2012  Molly       24
2  2013   Tina       31
5  2014    Amy        3

In [96]:
# group + value counts
df.groupby('year')['name'].value_counts() # pd series

year  name
2012  Jason    1
      Molly    1
2013  Tina     1
      Wang     1
      Zhu      1
2014  Amy      1
      Jake     1
Name: name, dtype: int64

In [97]:
# unstack: Unstack switches the rows to columns to get the activity counts as features.
df.groupby('year')['name'].value_counts().unstack().fillna('Nan')

name  Amy Jake Jason Molly Tina Wang  Zhu
year
2012  Nan  Nan     1     1  Nan  Nan  Nan
2013  Nan  Nan   Nan   Nan    1    1    1
2014    1    1   Nan   Nan  Nan  Nan  Nan

In [100]:
# more example about unstack and stack: 
# http://www.datasciencemadesimple.com/reshape-using-stack-unstack-function-pandas-python/
import pandas as pd
import numpy as np

header = pd.MultiIndex.from_product([['Semester1','Semester2'],['Maths','Science']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
 
df = pd.DataFrame(d,index=['Alisa','Bobby','Cathrine','Jack'],columns=header)
df

stacked_df=df.stack()
unstacked_df = stacked_df.unstack()

#stack at level 1
stacked_df_lvl=df.stack(level=0)
unstacked_df1 = stacked_df_lvl.unstack()

In [115]:
# df drop row by the index name 
df1 = df.drop(['Pima'], inplace = False) # inplace = true means we are changing the original df

# Drop a row by row number - Santa Cruz
df1.drop(df1.index[1], inplace = True) # or drop a range df.index[[1,2]]

# drop row if it contains a certian value, tricky way
df1 = df1[df.name != 'Jake']

# df drop column by column name
df1.drop('reports',axis=1, inplace = True)

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:8: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [127]:
# df filter based on two columns value and select report column - return a series
array_jason_2012_report = df.loc[(df['name']=='Jason') & (df['year']==2012)]['reports'].values # return a array
value_jason_2012_report = df.loc[(df['name']=='Jason') & (df['year']==2012)]['reports'][0] # return a number

# df filter based on a list of value of one column -return a pd
df[df['year'].isin([2012,2013])]

In [201]:
# Hierachical Index
df1 = df.set_index(['year','performance'])
df1.swaplevel('performance','year')
df1.index

MultiIndex(levels=[[2012, 2013, 2014], ['Awesome!', 'Not Bad']],
           labels=[[0, 0, 1, 2, 2, 1, 1], [1, 1, 0, 1, 1, 1, 0]],
           names=['year', 'performance'])

### Working with Text Data

### Data Manipulation

pandas.melt

In [25]:
# Reshape wide to long in pandas python with melt() function - http://www.datasciencemadesimple.com/reshape-wide-long-pandas-python-melt-function/
# parameters: id_vars, value_vars, var_name, value_name, col_level
df_melt = pd.melt(df,id_vars=['name', 'year','age'],value_vars='reports', var_name='type', value_name='values')

df_melt.head(2)

    name  year  age     type values
0  Jason  2012   20  reports      4
1  Molly  2012   31  reports     24

pandas.cut

In [19]:
# create bin using cut() function
bins = [0, 5, 20, 30, 40]
names = ['range1', 'range2', 'range3', 'range4']
df_cut = df.copy()
df_cut['report_range'] = pd.cut(df.reports, bins, labels=names)

df_cut.head()

                      dept   name  year reports  age report_range
Cochice     Data Analytics  Jason  2012       4   20       range1
Pima        Data Analytics  Molly  2012      24   31       range3
Santa Cruz  Data Analytics   Tina  2013      31   40       range4
Maricopa    Data Analytics   Jake  2014       2   31       range1
Yuma        Data Analytics    Amy  2014       3   25       range1

Pandas concat Vs append
1. Concat gives the flexibility to join based on the axis( all rows or all columns)
    - Parameters: join, axis, ignore_index
2. Append is the specific case(axis=0, join='outer') of concat

In [34]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

In [ ]:
pandas.append

In [28]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df = df.append(df2, ignore_index=True)

# less efficient
df3 = pd.DataFrame(columns=['A'])
for i in range(5):
    df3 = df3.append({'A': i}, ignore_index=True)

Pandas join Vs merge
1. Join is based on the indexes (set by set_index) on how variable = ['left','right','inner','couter']
2. Merge is based on any particular column each of the two dataframes, this columns are variables on like 'left_on', 'right_on', 'on: df_merged = pd.merge(left=df1, right=df2, on=None, left_on='col1', right_on='col2')

In [326]:
# pd, apply function
def num_missing(x):
    return sum(x.isnull())

#Applying per column:
print("Missing values per column:")
print(df.apply(num_missing, axis=0)) #axis=0 defines that function is to be applied on each column

#Applying per row:
print("\nMissing values per row:")
print(df.apply(num_missing, axis=1).head()) #axis=1 defines that function is to be applied on each row

Missing values per column:
name       0
year       0
reports    0
dtype: int64

Missing values per row:
Cochice       0
Pima          0
Santa Cruz    0
Maricopa      0
Yuma          0
dtype: int64

In [ ]:
# DataFrame - reindexing/selection/label manipulation

In [ ]:
# apply functions by group in pd
# Create an example dataframe
data = {'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
       'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]}
df = pd.DataFrame(data)
df.groupby('Platoon')['Casualties'].apply(lambda x:x.rolling(center=False,window=2).mean())

In [ ]:
# filter by

In [135]:
# pivot table
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})

pivot_table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum)

In [42]:
# pd, iterate
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.rand(2,4),columns=list('ABCD'))

df.head()

          A         B         C         D
0  0.112288  0.852736  0.665070  0.553730
1  0.677584  0.046569  0.557092  0.669515

In [ ]:
# value_counts(normalize=True) * 100 -> percent

In [45]:
# difference between assign and .copy()
df1 = pd.DataFrame([1,2,3,4,5])
print(id(df1))
df2 = df1
print(id(df2)) # Same id as df1
df3 = df1.copy()
print(id(df3)) # New object, new id.
df4 = df1.copy(deep=False)
print(id(df4)) # New object, new id.

df1 = pd.DataFrame([9, 9, 9])
print(id(df1)) # New object created and bound to name 'df1'.
print(id(df2))  # Old object's id not impacted.

4629596816
4629596816
4629596984
4629597432
4629597544
4629596816

In [ ]:
# pd.to_numeric vs np.float64
# To convert data we can use .astype() method on a series. 
# Also keep in mind the category typeit reduces size of a dataframe and makes computations faster. 
# We can convert to any value that can be used as categorydays of the week, gender, continent abbreviationsdepends on a context.

# errors : {ignore, raise, coerce}, default raise
         # If raise, then invalid parsing will raise an exception
         # If coerce, then invalid parsing will be set as NaN
         # If ignore, then invalid parsing will return the input


# convert If you already have numeric dtypes (int8|16|32|64,float64,boolean) you can convert it to another "numeric" dtype using Pandas .astype() method.
df.a = df['a'].astype(float)
# convert object dytpes to numberic
df.b = pd.to_numeric(df['b'], errors='coerce')

In [47]:
df

          a         b
0 -0.476457  1.023886
1 -2.418843  0.152334
2 -0.975074  0.337719
3 -0.586308 -0.714383
4  0.503497  0.244219
5  0.158147 -0.263069
6  0.060142 -1.283625
7  0.651882  0.182224
8  0.041512 -0.276535
9 -1.913913  1.434493

Missing Value Handling

**np.nan** allows for vectorized operations; its a float value, 

while **None**, by definition, forces object type, which basically disables all efficiency in numpy.

In [ ]:
import numpy as np
s_bad = pd.Series([1, None], dtype=object)
s_good = pd.Series([1, np.nan])
s_unknown = pd.Series([1,pd.NaT])

print(s_bad.dtype,s_good.dtype,s_unknown.dtype)


print(s_bad.isnull())
print(s_good.isnull())
print(s_unknown.isnull())

#print(np.isnan(s_bad)) -- cannot use isnan(), because s_bad is None type
print(np.isnan(s_good))
# print(np.isnan(s_unknown)) -- cannot use isnan(), because s_bad is None type

1. dropna
    - how: any(default), all (all : If all values are NA, drop that row or column.)
    - thresh: require that how many non-NA values
    - subset: define in which columns to look for missing values
    - inpalce: false(default)
2. fillna
3. replace
4. interpolate

#### Numpy

In [81]:
my_data = [1,2,3,4,5]
my_data = np.array(my_data, dtype=np.float32)

In [90]:
# sort numpy narray
np.sort(my_data)
np.sort(my_data)[::-1]

array([5., 4., 3., 2., 1.], dtype=float32)

# Series

### Woking with Text data

Methods like split return a Series of lists

In [68]:
s1 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])
s2 = s1.str.split('_')

# Elements in the split lists can be accessed using get or [] notation:
s2.str.get(1)
s1.str.split('_').str[1]

# Expand to a DataFrame using expand:
s1.str.split('_', expand = True)
s1.str.split('_', expand=True, n=1) # limit the number of splits
s1.str.rsplit('_', expand=True, n=1) # from the end of the string to the beginning of the string:

     0    1
0  a_b    c
1  c_d    e
2  NaN  NaN
3  f_g    h

Replace By default replaces regular expressions

In [69]:
s3 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', '', np.nan, 'CABA', 'dog', 'cat'])
s3.str.replace('^.a|dog', 'XX-XX ', case=False)

0           A
1           B
2           C
3    XX-XX ba
4    XX-XX ca
5
6         NaN
7    XX-XX BA
8      XX-XX
9     XX-XX t
dtype: object

In [37]:
# create a series
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])

In [38]:
# access data
print(s[100]) # with index lable
print(s[:3]) # with slice

a
100    a
101    b
102    c
dtype: object

In [13]:
# series iterate to get the index and value
for i, v in s.items():
    print(i,v)

100 a
101 b
102 c
103 d

In [21]:
# series to dict
s = pd.Series([1, 2, 3, 4])
s.to_dict()
{0: 1, 1: 2, 2: 3, 3: 4}

{0: 1, 1: 2, 2: 3, 3: 4}

In [ ]:
# create series from dict
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

In [1]:
# series to Value and Index (Arrary) to List
import pandas as pd
s= pd.Series([6,3,4,6])
print(s.values.tolist(),s.index.values.tolist())

[6, 3, 4, 6] [0, 1, 2, 3]

In [ ]:
# sort: same as pd .sort_values(ascending=True)

#### Filter Rows
-  https://stackoverflow.com/questions/15325182/how-to-filter-rows-in-pandas-by-regex

#### Write CSV

In [48]:
import csv
final = [{'Name':'A','Hour':0,'Time':120},{'Name':'A','Hour':1,'Time':219}]

with open('/Users/mwang/Documents/Mine/output.csv', 'w') as output_file:
    dict_writer = csv.DictWriter(output_file, keys, delimiter=',')
    dict_writer.writeheader()
    dict_writer.writerows(final)

In [49]:
import csv
keys = ['Name','Hour','Time']
final2 = [['B', 0, 110],['C', 1, 130]]

with open('/Users/mwang/Documents/Mine/output2.csv','w') as f:
    list_writer = csv.writer(f,delimiter=',')
    list_writer.writerow(keys) # write first column name
    for row in final2:
        list_writer.writerow(row) # write each row

#### Write TSV

In [27]:
import csv
keys = ['Name','Hour','Time']
final = [{'Name':'A','Hour':0,'Time':120},{'Name':'A','Hour':1,'Time':219}]
with open('/Users/mwang/Documents/Mine/output.tsv', 'w') as output_file:
    dict_writer = csv.DictWriter(output_file, keys, delimiter='\t')
    dict_writer.writeheader()
    dict_writer.writerows(final)

#### Dict

In [20]:
from collections import defaultdict
d1 = {1: 2, 3: 4, 5: 0}
d2 = {1: 6, 3: 7, 4: 8}


# join the two dicts based on the same keys
# create new dict
dd = defaultdict(list)
# 1: all join
for d in (d1, d2): # you can list as many input dicts as you want here
    for key, value in d.items():
        dd[key].append(value)

        
        
# create new dict
dd = defaultdict(list)
# 2: left join
for k1,value in d1.items():
    dd[k1].append(value)
    if k1 in d2.keys():
        dd[k1].append(d2[k1])
    else:
        dd[k1].append('Nan')

print(dd)

defaultdict(<class 'list'>, {1: [2, 6], 3: [4, 7], 5: [0, 'Nan']})

In [2]:
# convert list of dict to df
my_list = [{u'data': {u'approved_by': None,
            u'archived': False,
            u'author': u'des-tal',
            u'controversiality': 0,
            u'user_reports': []},
            u'kind': u't1'},

             {u'data': {u'approved_by': None,
            u'archived': True,
            u'author': u'des-tal',
            u'controversiality': 0,
            u'user_reports': []},
            u'kind': u't1'}]

import pandas as pd
df = pd.DataFrame([i['data'] for i in my_list])
df.head()

  approved_by  archived   author  controversiality user_reports
0        None     False  des-tal                 0           []
1        None      True  des-tal                 0           []

In [3]:
# print
from tabulate import tabulate
print(tabulate(df, headers='keys', tablefmt='psql'))

+----+---------------+------------+----------+--------------------+----------------+
|    | approved_by   | archived   | author   |   controversiality | user_reports   |
|----+---------------+------------+----------+--------------------+----------------|
|  0 |               | False      | des-tal  |                  0 | []             |
|  1 |               | True       | des-tal  |                  0 | []             |
+----+---------------+------------+----------+--------------------+----------------+

In [2]:
# find the max value in a dict as well its key
import operator
stats = {'a':1000, 'b':3000, 'c': 100}
max(stats.items(), key=operator.itemgetter(1))[0]

('b', 3000)

#### File

In [ ]:
# Import necessary modules
import glob
import pandas as pd 
# Write the pattern: pattern 
pattern = '*.csv' 
# Save all file matches: csv_files
csv_files = glob.glob(pattern) 
# Create an empty list: frames
frames = [] 
# Iterate over csv_files 
for csv in csv_files: 
    # Read csv into a DataFrame: df 
    df = pd.read_csv(csv) 
    # Append df to frames 
    frames.append(df)
# Concatenate frames into a single DataFrame: final_df
final_df = pd.concat(frames)

#### Good to know

Inplace: https://stackoverflow.com/questions/45570984/pandas-is-inplace-true-considered-harmful-or-not